In [1]:
#oprations

In [1]:
import numpy as np
import pandas as pd

In [3]:
df=pd.DataFrame({
    'col1':['GANA','DYANA','KUNA','OMKU','ATHU'],
    'col2':[19,19,18,19,17],
     'salary':['2L','2L','3L','3L','2L']
    
})

In [4]:
df

    col1  col2 salary
0   GANA    19     2L
1  DYANA    19     2L
2   KUNA    18     3L
3   OMKU    19     3L
4   ATHU    17     2L

In [11]:
df.sum()

col1      GANADYANAKUNAOMKUATHU
col2                         92
salary               2L2L3L3L2L
dtype: object

In [12]:
df.isnull()

    col1   col2  salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False

In [13]:
df.head()

    col1  col2 salary
0   GANA    19     2L
1  DYANA    19     2L
2   KUNA    18     3L
3   OMKU    19     3L
4   ATHU    17     2L

In [22]:
df.drop('col2',axis=1)

    col1 salary
0   GANA     2L
1  DYANA     2L
2   KUNA     3L
3   OMKU     3L
4   ATHU     2L

In [23]:
df

    col1  col2 salary
0   GANA    19     2L
1  DYANA    19     2L
2   KUNA    18     3L
3   OMKU    19     3L
4   ATHU    17     2L

In [28]:
df[df[['col2']0]]

TypeError: '>' not supported between instances of 'list' and 'int'

In [30]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [31]:
df

    col1  col2 salary
0   GANA    19     2L
1  DYANA    19     2L
2   KUNA    18     3L
3   OMKU    19     3L
4   ATHU    17     2L

In [34]:
df.sort_values('col2')

    col1  col2 salary
4   ATHU    17     2L
2   KUNA    18     3L
0   GANA    19     2L
1  DYANA    19     2L
3   OMKU    19     3L